#### Básico

In [1]:
import pandas as pd
pd.__version__

'1.3.4'

In [2]:
df_meteorites = pd.read_csv('./input/Meteorite_Landings.csv')

In [3]:
df_meteorites.describe()

                 id      mass (g)        reclat       reclong
count  45716.000000  4.558500e+04  38401.000000  38401.000000
mean   26889.735104  1.327808e+04    -39.122580     61.074319
std    16860.683030  5.749889e+05     46.378511     80.647298
min        1.000000  0.000000e+00    -87.366670   -165.433330
25%    12688.750000  7.200000e+00    -76.714240      0.000000
50%    24261.500000  3.260000e+01    -71.500000     35.666670
75%    40656.750000  2.026000e+02      0.000000    157.166670
max    57458.000000  6.000000e+07     81.166670    354.473330

In [4]:
df_meteorites.shape

(45716, 10)

In [5]:
df_meteorites.sample(5)

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
5173,Bonnie Claire 002,5106,Valid,H5,80.80,Found,01/01/1998 12:00:00 AM,37.21667,-117.08333,"(37.21667, -117.08333)"
17342,Kenna (b),12278,Valid,L5,453.00,Found,01/01/1972 12:00:00 AM,33.70833,-103.76667,"(33.70833, -103.76667)"
44077,Yamato 981308,37930,Valid,H5,86.92,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.0, 0.0)"
7383,Dhofar 157,6942,Valid,H5,5300.00,Found,01/01/2000 12:00:00 AM,19.08833,54.79267,"(19.08833, 54.79267)"
15612,Grove Mountains 053579,50553,Valid,L6,3.85,Found,01/01/2006 12:00:00 AM,-72.78083,75.30111,"(-72.78083, 75.30111)"

In [6]:
pd.options.display.float_format = '{:,.1f}'.format

In [7]:
df_meteorites.describe(include='all')

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
count,45716,"45,716.0",45716,45716,"45,585.0",45716,45425,"38,401.0","38,401.0",38401
unique,45716,NaN,2,466,NaN,2,266,NaN,NaN,17100
top,Aachen,NaN,Valid,L6,NaN,Found,01/01/2003 12:00:00 AM,NaN,NaN,"(0.0, 0.0)"
freq,1,NaN,45641,8285,NaN,44609,3323,NaN,NaN,6214
mean,NaN,"26,889.7",NaN,NaN,"13,278.1",NaN,NaN,-39.1,61.1,NaN
std,NaN,"16,860.7",NaN,NaN,"574,988.9",NaN,NaN,46.4,80.6,NaN
min,NaN,1.0,NaN,NaN,0.0,NaN,NaN,-87.4,-165.4,NaN
25%,NaN,"12,688.8",NaN,NaN,7.2,NaN,NaN,-76.7,0.0,NaN
50%,NaN,"24,261.5",NaN,NaN,32.6,NaN,NaN,-71.5,35.7,NaN
75%,NaN,"40,656.8",NaN,NaN,202.6,NaN,NaN,0.0,157.2,NaN
max,NaN,"57,458.0",NaN,NaN,"60,000,000.0",NaN,NaN,81.2,354.5,NaN

In [8]:
df_meteorites.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass (g)     45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45425 non-null  object
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 3.5+ MB

In [9]:
df_meteorites.dtypes

name            object
id               int64
nametype        object
recclass        object
mass (g)       float64
fall            object
year            object
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

In [10]:
df_meteorites.convert_dtypes().dtypes

name            string
id               Int64
nametype        string
recclass        string
mass (g)       Float64
fall            string
year            string
reclat         Float64
reclong        Float64
GeoLocation     string
dtype: object

### Estructuras

In [11]:
df_meteorites.nunique()

name           45716
id             45716
nametype           2
recclass         466
mass (g)       12576
fall               2
year             266
reclat         12738
reclong        14640
GeoLocation    17100
dtype: int64

In [12]:
df_meteorites[['fall', 'nametype']] = df_meteorites[['fall', 'nametype']].astype('category')

In [13]:
df_meteorites.dtypes

name             object
id                int64
nametype       category
recclass         object
mass (g)        float64
fall           category
year             object
reclat          float64
reclong         float64
GeoLocation      object
dtype: object

In [14]:
df_meteorites['fall'].unique()

['Fell', 'Found']
Categories (2, object): ['Fell', 'Found']

In [15]:
df_meteorites['fall'].value_counts()

Found    44609
Fell      1107
Name: fall, dtype: int64

In [16]:
df_meteorites[['fell', 'found']] = pd.get_dummies(df_meteorites['fall'])

#### dates

In [17]:
df_meteorites['year'] = pd.to_datetime(
    df_meteorites['year'],
    errors = 'coerce', 
    format = '%m/%d/%Y %H:%M:%S:%p'
)

In [18]:
df_meteorites.dtypes

name                   object
id                      int64
nametype             category
recclass               object
mass (g)              float64
fall                 category
year           datetime64[ns]
reclat                float64
reclong               float64
GeoLocation            object
fell                    uint8
found                   uint8
dtype: object

In [19]:
df_meteorites.rename(columns={'mass (g)': 'mass'}, inplace=True)

In [23]:
df_meteorites[['fall', 'nametype']] = df_meteorites[['fall', 'nametype']].astype('category')

In [24]:
df_meteorites['fall'].value_counts()

Found    44609
Fell      1107
Name: fall, dtype: int64

In [25]:
df_meteorites['fall'].value_counts()
df_meteorites[['fell', 'found']] = pd.get_dummies(df_meteorites['fall'])

       Fell  Found
0         1      0
1         1      0
2         1      0
3         1      0
4         1      0
...     ...    ...
45711     0      1
45712     0      1
45713     0      1
45714     0      1
45715     0      1

[45716 rows x 2 columns]

In [26]:
df_meteorites['ones'] = 1
df_meteorites.drop('ones', axis=1, inplace=True)

In [27]:
# borrar  filas

In [28]:
df_meteorites.drop([0,2,4,6]).head()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation,fell,found
1,Aarhus,2,Valid,H6,720.0,Fell,NaT,56.2,10.2,"(56.18333, 10.23333)",1,0
3,Acapulco,10,Valid,Acapulcoite,"1,914.0",Fell,NaT,16.9,-99.9,"(16.88333, -99.9)",1,0
5,Adhi Kot,379,Valid,EH4,"4,239.0",Fell,NaT,32.1,71.8,"(32.1, 71.8)",1,0
7,Agen,392,Valid,H5,"30,000.0",Fell,NaT,44.2,0.6,"(44.21667, 0.61667)",1,0
8,Aguada,398,Valid,L6,"1,620.0",Fell,NaT,-31.6,-65.2,"(-31.6, -65.23333)",1,0

In [30]:
df_meteorites.drop(index=[0,2,4,6], columns=['id', 'recclass']).head()

,name,nametype,mass,fall,year,reclat,reclong,GeoLocation,fell,found
1,Aarhus,Valid,720.0,Fell,NaT,56.2,10.2,"(56.18333, 10.23333)",1,0
3,Acapulco,Valid,"1,914.0",Fell,NaT,16.9,-99.9,"(16.88333, -99.9)",1,0
5,Adhi Kot,Valid,"4,239.0",Fell,NaT,32.1,71.8,"(32.1, 71.8)",1,0
7,Agen,Valid,"30,000.0",Fell,NaT,44.2,0.6,"(44.21667, 0.61667)",1,0
8,Aguada,Valid,"1,620.0",Fell,NaT,-31.6,-65.2,"(-31.6, -65.23333)",1,0

In [31]:
df = df_meteorites.copy(deep=True)